Revit 2027 API
MetallicpaintFlecksType Enumeration
 The enumerated type representing the permitted values for the asset property "MetallicpaintFlecks" from the "MetallicPaint" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum MetallicpaintFlecksType
Public Enumeration MetallicpaintFlecksType
public enum class MetallicpaintFlecksType
type MetallicpaintFlecksType
Members
Member name | Value | Description
Enable | 1
None | 0
See Also
Reference
Autodesk.Revit.DB.Visual Namespace